waveFlume/case2-regular/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    atmosphere
    {
        type            patch;
        nFaces          1250;
        startFace       248650;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       249900;
    }
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       250000;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1250;
        startFace       250100;
    }
    leftSide
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          125000;
        startFace       251350;
    }
    rightSide
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          125000;
        startFace       376350;
    }
)

// ************************************************************************* //
